p2/chen.reid.hu.gaoyi.P2.tex
% Created 2021-10-06 Wed 01:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Reid Chen, Gaoyi Hu}
\date{\today}
\title{P2}
\hypersetup{
 pdfauthor={Reid Chen, Gaoyi Hu},
 pdftitle={P2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{JLex}
\label{sec:org26c5035}
The crux of this project is to come up a way to distinguish the 4 scenarios of
string literals. When set a state called \texttt{OKSTR} when JLex sees a \texttt{"} to indicate that the JLex is
currently looking at a legal string literal. We let JLex to match one
character at a time. If JLex sees another \texttt{"}, then this string is
terminated. If JLex sees a \texttt{\textbackslash{}}, we enter a state called \texttt{BACKSLASH}. Now,
there are two cases. If JLex sees one of \(\{n, t, ?, \backslash, "\}\), then it is a
valid escape, so we go back to state \texttt{OKSTR}. On the other hand, if the
character after \texttt{\textbackslash{}} is not one of the valid escape character, the JLex enters
\texttt{BAD\_ESCAPED} state, indicating that this string literal now is bad. JLex
check if a string literal in \texttt{BAD\_ESCAPED} is terminated or not using a
similar logic as \texttt{OKSTR}.
\section{Testing}
\label{sec:org118d62b}
We have created 3 directories to store the testing files. \texttt{inputs} stores all
the inputs. \texttt{outputs} stores the standard outputs. \texttt{expects} stores the
expected standard outputs. The correctness of standard errors, i.e. the
message produced by the \texttt{ErrMsg} are checked in the main of P2, instead of
using \texttt{diff} to compare the expected outputs and the actual outputs.

To standard error (error messages), we redirect `System.Err` to a customized
stream. And compare the expected String with the String of the stream.
\end{document}
